In [5]:
# Importing libraries
import pandas as pd
import matplotlib.pyplot as plt
from datasets import load_dataset

# Loading data
data = load_dataset("lukebarousse/data_jobs")
dfe = data['train'].to_pandas()

# Cleaning data
dfe['job_posted_date'] = pd.to_datetime(dfe['job_posted_date'])

c:\Users\Namitha john\anaconda3\envs\python_course\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [6]:
dfe.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [8]:
salary_year_median = dfe['salary_year_avg'].median()
salary_year_median

115000.0

In [9]:
salary_hour_median = dfe['salary_hour_avg'].median()
salary_hour_median

45.97999954223633

In [12]:
df_filled = dfe
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(salary_year_median)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(salary_hour_median)

In [13]:
df_filled.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [14]:
df_unique = df_filled
df_unique = df_unique.drop_duplicates()

print('total_rows:     ', len(df_filled))
print('final_rows:      ', len(df_unique))
print('deleted_rows:    ', len(df_filled)-len(df_unique))

total_rows:      785741
final_rows:       785640
deleted_rows:     101

In [15]:
df_unique = df_unique.drop_duplicates(subset=['job_title','company_name'])

print('total_rows:     ', len(df_filled))
print('final_rows:      ', len(df_unique))
print('deleted_rows:    ', len(df_filled)-len(df_unique))

total_rows:      785741
final_rows:       508042
deleted_rows:     277699